Revit 2027 API
StairsEndNotchOption Enumeration
 The style of notch width for the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsEndNotchOption
Public Enumeration StairsEndNotchOption
public enum class StairsEndNotchOption
type StairsEndNotchOption
Members
Member name | Value | Description
Custom | 1 |  The notch width is customized by user.
FullRunWidth | 0 |  The notch width is the run width.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace